driver-tests/bpelse/pick/PickJbi/test/pickTimer1/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://seebeyond.com/pickTimer/"
                   xmlns="urn:pickTimer">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
  <pickTimerOperation>
   <pickTimerPart>
                       <string></string>
                    <nonNegativeInteger>100</nonNegativeInteger>
                    <byte>a</byte>
                    <short>5</short>
                    <int>12345</int>
                    <long>15</long>
                    <negativeInteger>-100</negativeInteger>
                    <dateTime>10/10/2000</dateTime>
                    <nonPositiveInteger>0</nonPositiveInteger>
                    <duration>P0Y0M0DT0H0M15S</duration>
                    <ENTITIES>string byte short</ENTITIES>
                    <double>1.111</double>
                    <ENTITY>byte</ENTITY>
                    <float>1.11</float>
   </pickTimerPart>
  </pickTimerOperation>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>